haliwt/Drv8302_mkv46f256vlh16_servo/main.c
													    }
													
													else if(abs(en_t.Horizon_Position) < 200){
													/* one key study*/
													Dir =1 ; /* motor move horizon  */
													PWM_Duty =50;
													motor_ref.motor_run = 1;
													printf("Hor_4_0 = %d\r\n",en_t.Horizon_Position);
													}
												  
												}
										 
					                     }
								 }
								/*******************************************************/
								/*******************VERTICAL****************************/
								else{ /*direction to vertical Dir = 1,from horizon to vetical*/
									   judge_n++; 
								        /*HALL_Pulse < 0*/
										PRINTF("Vertical judge_n = %d\n\r",judge_n);
										PRINTF("End_H_flag = %d \r\n",en_t.End_H_flag);
										PRINTF("First_H_dec = %d \r\n",en_t.First_H_dec);
								       
										if(judge_n==1 ||judge_n==3 ){
											 
											    en_t.First_V_dec =1;
												en_t.oneKey_V_flag =1;
											   en_t.Vertical_Position = mHoldPos;
												 printf("Vertical_Position = %ld\r\n",en_t.Vertical_Position);
                                                if(abs(en_t.Vertical_Position)<1024 ){
                                                   en_t.mini_value =mHoldPos;
                                                   Dir =1 ; /* motor move horizon  */
                                                   PWM_Duty =50;
                                                   motor_ref.motor_run = 1;
                                  
                                                   printf("--VerPos_1_1 = %ld\r\n",en_t.Vertical_Position);
												   
                                                  
                                                }
												else if(abs(en_t.Vertical_Position)> 800){
												   Dir =0 ; /* motor move horizon  */
                                                   PWM_Duty =50;
                                                   motor_ref.motor_run = 1;
                                                   en_t.Horizon_Position =0;
                                                   printf("3333333333333333333 \n");
                                                   
												   
                                                   printf("--VerPos_1_3 = %ld\r\n",en_t.Vertical_Position);
												   
                                                  
												}
											}
										    else if((judge_n==2)||(judge_n ==4)){ 
											    
													if(judge_n==4)judge_n=2;
													en_t.Vertical_Position = mHoldPos;
												   if(abs(en_t.mini_value) <1000 && en_t.First_V_dec ==1&& abs(mHoldPos)<1000){
													 judge_n=0;  
													Dir =1 ; /* motor move vertical  */
                                                   PWM_Duty =50;
                                                   motor_ref.motor_run = 1;
												   en_t.Vertical_Position = mHoldPos;
                                                   printf(" dir=2_0 VerPos2_0=%d \r\n",en_t.Vertical_Position);
                                                 

												   }
													else{
												    en_t.End_V_flag = 1;
												
			
												    HALL_Pulse =0;
												 
												 if(abs(en_t.Vertical_Position) >= 800){

													 Dir =1 ; /* motor move vertical  */
													 PWM_Duty =50;
													 motor_ref.motor_run = 1;
													 PRINTF("--VerPos_2-0 = %d\r\n",en_t.Vertical_Position);
												 	}
												 else if(abs(en_t.Vertical_Position) < 100){
														  /*one key study*/
														 Dir =0 ; /* motor move horizon  */
														 PWM_Duty =50;
														 motor_ref.motor_run = 1;
														 printf("--VerPos_2-2 = %d\r\n",en_t.Vertical_Position);
														 printf("ML auto dir reverse = 2@@@@@@@@@@@ \n");
												 	}
													
												}
									   		 }	
								}
						
						
						}//end if(EndBuf[0]==EndBuf[1])
                  
                  
                   }//end if(j==3)
                   if(judge_n==3 || judge_n == 1){
                     if((Dir == 0)&&judge_n ==1){
                                en_t.eInit_n++;     
                     } 
                     else{
						 	      en_t.eInit_n++;
                     }
								  printf("eInit_n = %d \r\n",en_t.eInit_n);
								  en_t.HorizonStop_flag=0;
								  HALL_Pulse =0;
						           lhoradd=0;
							       tempadd=0;
                                  iError =0;
								  en_t.VH_Total_Dis=1;
                                  PID_PWM_Duty=50;
								PMW_AllClose_ABC_Channel();
                                motor_ref.motor_run = 0;
								  /* algorithm */
								  if(en_t.Horizon_Position > en_t.Vertical_Position)
								  	en_t.mini_value = en_t.Vertical_Position;
								  else en_t.mini_value = en_t.Horizon_Position ;
								  en_t.VH_Total_Dis = abs(en_t.Horizon_Position -en_t.Vertical_Position);//Toatal= horizonPos-verticalPos
				     }
				    if(j>=3){
                     j=0;
                    
			} //end if(eIn_n >=3)
            
        }
        if(eIn_n >= 3)eIn_n =0;
		if(judge_n > 4)judge_n =0;
		}//end en_t.eIn_n == 0
        
#endif 
    /********************************************************************************/     
    /***********motor run main*********************/
     if((motor_ref.motor_run == 1)&&(en_t.HorizonStop_flag !=2))
     {
   		  if(en_t.eInit_n == 1){
            
           if(en_t.DIR_flag ==1)PWM_Duty =50;
			  else
			  PWM_Duty = PID_PWM_Duty;
			   
   		  	}
		  else if(en_t.eInit_n == 0)
		  {
			if(Dir ==0){/*start detected horizon position motor  speed slowly limit*/
                  m++;
				  if(m >1000)
				  {
					  mn ++;
					  if(mn<=50) {
					 
	                     PWM_Duty = 50 - mn;
	                    
	                  }
					  else PWM_Duty = 0 ;
				  }
				  else if(m< 500) PWM_Duty = 30 ;
#if 1
             
		
               if(abs(en_t.Horizon_Position) > 800 && en_t.Pos_diff >0){
						printf("HorizonPos >800 \r\n");
			   		    ldiff =abs(mCurPosValue);
						if(ldiff > 800){

