haliwt/Drv8302_mkv46f256vlh16_servo/main.c
                                }
								PWM_Duty = 0;
								en_t.HorizonStop_flag =1;
								dError_sum = 0;
									iError=0;
								 last_iError =0;
						   }
							 HALL_Pulse =0;					

						}
					    if(en_t.HorizonStop_flag ==1){
                             Dir =1;
                            PWM_Duty =30;
                            uwStep = HallSensor_GetPinState();
                            HALLSensor_Detected_BLDC(PWM_Duty);
                            
                        }
                        else
					    {
						    dError_sum += iError; 
							
						    if(dError_sum > 1000)dError_sum =1000; /*error accumulate */
							if(dError_sum < -1000)dError_sum = -1000; 
		                    PID_PWM_Duty = (int32_t)(iError *pid_r.KP_H + dError_sum * pid_r.KI_H + (iError - last_iError)*pid_r.KD_H);//proportion + itegral + differential
					       
						    printf("hor_pwm= %ld\r \n",PID_PWM_Duty);
							
							PID_PWM_Duty = abs(PID_PWM_Duty)/2;
							if(PID_PWM_Duty >=50)PID_PWM_Duty=50;

		                 	last_iError = iError;
							PWM_Duty = PID_PWM_Duty;
							HALL_Pulse =0;
                             if(en_t.HorizonStop_flag ==2){
                             Dir = 1;
						     PWM_Duty = 30;
							 iError =0;
							 last_iError =0;
							 HALL_Pulse =0;
						   }
                        }
				
			}
            /***************************************************/
            /****************************************************/
            /**************************************************/
			else{  //Vertical Position judge is boundary
					   PWM_Duty=50;
                 
                       if(abs(en_t.Horizon_Position) > 800 ){
							
							
							 if(abs(mCurPosValue)<200){
					  	      
							    for(ldectnum =0;ldectnum<30;ldectnum++){
								 ldectnum++;
                                 if(ldectnum <=30){
								     PWM_Duty = 30 - ldectnum;
                                 }
                                 else  PWM_Duty =0;
								 uwStep = HallSensor_GetPinState();
			                     HALLSensor_Detected_BLDC(PWM_Duty);
                                 printf("V>800 break !!!!!!!\r\n");
							 }
	                         PMW_AllClose_ABC_Channel();
	                         motor_ref.motor_run =0;
                             printf("VDffcurrPOS= %d \n\r",mCurPosValue);
							 printf("V>800\r\n");
							 printf("V~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r\n");
							 ivError =0;
							 last_iError=0;
							 en_t.DIR_flag=0;
							 }
							 
						}
						else if(abs(en_t.Horizon_Position) < 300 ){
							
							 
							 if(abs(mCurPosValue) >  800){
					  	      
							 for(ldectnum =0;ldectnum<30;ldectnum++){
								 ldectnum++;
								if(ldectnum <=30){
								     PWM_Duty = 30 - ldectnum;
                                 }
                                 else  PWM_Duty =0;
								 uwStep = HallSensor_GetPinState();
			                     HALLSensor_Detected_BLDC(PWM_Duty);
                                 PRINTF("V < 100 break #####\r\n");
							 }
	                         PMW_AllClose_ABC_Channel();
	                         motor_ref.motor_run =0;
                             PRINTF("VDffcurrPOS= %d \n\r",mCurPosValue);
							 PRINTF("V < 100 !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\r\n");
							 ivError =0;
							 last_iError=0;
							 en_t.DIR_flag=0;
                             lhoradd=0;
							  tempadd=0;
							 
							 }	
						}

			    
			}
			
		}
	   if(Time_CNT >=25){
			Time_CNT = 0;
			
	   	}
	   #endif 
	 } 
     else if(en_t.HorizonStop_flag==2){
          en_t.DIR_flag = 1;
          Dir =1;
          PWM_Duty =30; /*real be test*/
          uwStep = HallSensor_GetPinState();
          HALLSensor_Detected_BLDC(PWM_Duty);
 		  
          Dir =0;
		  PRINTF("flag=2 stop CurrPos !!!!!!!\n");
		  #if AUTOMATICA 
		   Dir = 1;
		   en_t.HorizonStop_flag= 0;
           motor_ref.motor_run =1;
		   en_t.DIR_flag = 1;

           #endif
		  // Self_Locking();
		  
		  
     
     }
    else if(en_t.eInit_n !=0){ 
            
		    en_t.HorizonStop_flag=0;
			PMW_AllClose_ABC_Channel();
			HALL_Pulse =0;
			iError =0;
			#ifdef DRV8302
			GPIO_PinWrite(DRV8302_EN_GATE_GPIO,DRV8302_EN_GATE_GPIO_PIN,0);
			#endif 
		  en_t.DIR_flag =1;
	      DelayMs(50);
	      GPIO_PortToggle(GPIOD,1<<BOARD_LED1_GPIO_PIN);
	      DelayMs(50);
	      HALL_Pulse =0;
         if(motor_ref.motor_run == 3){
				  UART_ReadBlocking(DEMO_UART, RxBuffer, 5);
				  PRINTF("PID input referece \n");
                  for(i=0;i<8;i++){
				  	    
						  if(RxBuffer[0]==0xff){
							  pid_r.KD_H=RxBuffer[1];
		                      pid_r.KI_H=RxBuffer[2];
							  pid_r.KD_H=RxBuffer[3];
							 
		                      motor_ref.motor_run =RxBuffer[4];
		                     PRINTF("KP KI KD = %d %d %d \n\r",pid_r.KP_H,pid_r.KI_H,pid_r.KD_H);
							 
							 
					  	  }
						  else{
								 k0=RxBuffer[0];
								 PRINTF("USART Error !!!!!!!!\n\r");
								 PRINTF("k0 = %d \n\r",k0);
								 PRINTF("KP KI KD = %d %d %d \n\r",pid_r.KP_H,pid_r.KI_H,pid_r.KD_H);
								
								  motor_ref.motor_run =RxBuffer[7];
						      }
                        }
		          
					}
         #if AUTOMATICA 
		   Dir = 0;
		   en_t.HorizonStop_flag= 0;
           motor_ref.motor_run =1;
		   en_t.DIR_flag = 1;

           #endif
		
    }
            
    
   
   /**********8Key process********************/  
   if(ucKeyCode !=KEY_UP){

	  switch(ucKeyCode){ 
                 
                  case DIR_CW_PRES ://Dir =1 ,PTE29-CW,KEY1,motor to Vertical 
				  	  HALL_Pulse =0;
                      en_t.DIR_flag = 1;
	  				  if(en_t.HorizonStop_flag==2){
							
						  for(lkeydir=0;lkeydir< 500;lkeydir++){
							  Dir =1;
							  PWM_Duty =50; /*real be test*/
					          uwStep = HallSensor_GetPinState();
					          HALLSensor_Detected_BLDC(PWM_Duty);
						  }
						
						  en_t.HorizonStop_flag= 0;
                          motor_ref.motor_run =1;
						  en_t.DIR_flag = 1;
                          
